#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
infra-data relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/dphoto/dphoto/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/dphoto/dphoto

To view this run in a browser, visit:
https://app.terraform.io/app/dphoto/dphoto-live/runs/run-898yokLmDqw9u1J4

Waiting for the plan to start...

Terraform v1.2.5
on linux_amd64
Initializing plugins and modules...
aws_iam_access_key.cli: Refreshing state... [id=AKIAW32ATO5LD7TVC6NI]
aws_sqs_queue.async_archive_caching_jobs: Refreshing state... [id=https://sqs.eu-west-1.amazonaws.com/472045025110/dphoto-live-async-archive-caching-jobs.fifo]
aws_s3_bucket.cache: Refreshing state... [id=dphoto-live-cache]
data.aws_iam_policy_document.index_rw: Reading...
aws_sns_topic.archive: Refreshing state... [id=arn:aws:sns:eu-west-1:472045025110:dphoto-live-archive-jobs]
aws_s3_bucket.storage: Refreshing state... [id=dphoto-live-storage]
aws_iam_user.cli: Refreshing state... [id=dphoto-live-cli]
aws_kms_key.storage[0]: Refreshing state... [id=64ce2c68-36b4-49cf-8f4e-4e78ec71a41c]
aws_ssm_parameter.catalog_table_name: Refreshing state... [id=/dphoto/live/dynamodb/catalog/tableName]
data.aws_iam_policy_document.index_rw: Read complete after 0s [id=1595237765]
aws_iam_policy.index_rw: Refreshing state... [id=arn:aws:iam::472045025110:policy/dphoto/dphoto-live-index-rw]
aws_iam_user_policy_attachment.cli_table: Refreshing state... [id=dphoto-live-cli-20210527210154843500000002]
aws_ssm_parameter.iam_policy_dyn_table_rw: Refreshing state... [id=/dphoto/live/iam/policies/indexRWArn]
data.aws_iam_policy_document.archive_sqs_send: Reading...
aws_ssm_parameter.sqs_archive_url: Refreshing state... [id=/dphoto/live/sqs/archive/url]
aws_ssm_parameter.sqs_archive_arn: Refreshing state... [id=/dphoto/live/sqs/archive/arn]
data.aws_iam_policy_document.archive_sqs_send: Read complete after 0s [id=753618035]
aws_iam_policy.archive_sqs_send: Refreshing state... [id=arn:aws:iam::472045025110:policy/dphoto-live-archive-sqs-send]
data.aws_iam_policy_document.archive_sns_publish: Reading...
data.aws_iam_policy_document.archive_sqs: Reading...
data.aws_iam_policy_document.archive_sns_publish: Read complete after 0s [id=393849065]
data.aws_iam_policy_document.archive_sqs: Read complete after 0s [id=773311283]
aws_ssm_parameter.sns_archive_arn: Refreshing state... [id=/dphoto/live/sns/archive/arn]
aws_iam_policy.archive_sns_publish: Refreshing state... [id=arn:aws:iam::472045025110:policy/dphoto-live-archive-sns-publish]
aws_sqs_queue_policy.async_archive_caching_jobs: Refreshing state... [id=https://sqs.eu-west-1.amazonaws.com/472045025110/dphoto-live-async-archive-caching-jobs.fifo]
aws_ssm_parameter.iam_policy_archive_sqs_send: Refreshing state... [id=/dphoto/live/iam/policies/archive_sqs_send/arn]
aws_iam_user_policy_attachment.archive_sqs_send: Refreshing state... [id=dphoto-live-cli-20220728232010840800000003]
aws_iam_user_policy_attachment.archive_sns_publish: Refreshing state... [id=dphoto-live-cli-20220728231945971600000001]
aws_ssm_parameter.iam_policy_archive_sns_publish: Refreshing state... [id=/dphoto/live/iam/policies/archive_sns_publish/arn]
aws_ssm_parameter.cache_bucket_name: Refreshing state... [id=/dphoto/live/s3/cache/bucketName]
data.aws_iam_policy_document.cache_rw: Reading...
aws_s3_bucket_versioning.cache: Refreshing state... [id=dphoto-live-cache]
aws_s3_bucket_public_access_block.s3_cache_block_public_access: Refreshing state... [id=dphoto-live-cache]
aws_s3_bucket_acl.cache: Refreshing state... [id=dphoto-live-cache,private]
aws_s3_bucket_lifecycle_configuration.cache_expiration: Refreshing state... [id=dphoto-live-cache]
aws_s3_bucket_ownership_controls.cache: Refreshing state... [id=dphoto-live-cache]
data.aws_iam_policy_document.cache_rw: Read complete after 0s [id=129955124]
aws_iam_policy.cache_rw: Refreshing state... [id=arn:aws:iam::472045025110:policy/dphoto/dphoto-live-cache-rw]
aws_s3_bucket_versioning.storage: Refreshing state... [id=dphoto-live-storage]
aws_s3_bucket_server_side_encryption_configuration.storage["arn:aws:kms:eu-west-1:472045025110:key/64ce2c68-36b4-49cf-8f4e-4e78ec71a41c"]: Refreshing state... [id=dphoto-live-storage]
data.aws_iam_policy_document.storage_ro: Reading...
data.aws_iam_policy_document.storage_ro: Read complete after 0s [id=2651647098]
aws_s3_bucket_ownership_controls.storage: Refreshing state... [id=dphoto-live-storage]
aws_s3_bucket_public_access_block.s3_storage_block_public_access: Refreshing state... [id=dphoto-live-storage]
aws_s3_bucket_lifecycle_configuration.storage: Refreshing state... [id=dphoto-live-storage]
aws_ssm_parameter.storage_bucket_name: Refreshing state... [id=/dphoto/live/s3/storage/bucketName]
aws_s3_bucket_acl.storage: Refreshing state... [id=dphoto-live-storage,private]
data.aws_iam_policy_document.storage_rw: Reading...
data.aws_iam_policy_document.storage_rw: Read complete after 0s [id=2008889015]
aws_iam_policy.storage_ro: Refreshing state... [id=arn:aws:iam::472045025110:policy/dphoto/dphoto-live-storage-ro]
aws_ssm_parameter.iam_policy_cache_rw: Refreshing state... [id=/dphoto/live/iam/policies/cacheRWArn]
aws_iam_user_policy_attachment.cli_cache: Refreshing state... [id=dphoto-live-cli-20220728231947722900000002]
aws_iam_policy.storage_rw: Refreshing state... [id=arn:aws:iam::472045025110:policy/dphoto/dphoto-live-storage-rw]
aws_ssm_parameter.iam_policy_bucket_ro: Refreshing state... [id=/dphoto/live/iam/policies/storageROArn]
aws_iam_user_policy_attachment.cli_bucket: Refreshing state... [id=dphoto-live-cli-20210527210154836100000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_access_key.rolling_cli["2022-12"] will be created
  + resource "aws_iam_access_key" "rolling_cli" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + pgp_key                        = "keybase:thomasduchatelle"
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "dphoto-live-cli"
    }

  # aws_s3_bucket_server_side_encryption_configuration.cache["arn:aws:kms:eu-west-1:472045025110:key/64ce2c68-36b4-49cf-8f4e-4e78ec71a41c"] will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "cache" {
      + bucket = "dphoto-live-cache"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = "arn:aws:kms:eu-west-1:472045025110:key/64ce2c68-36b4-49cf-8f4e-4e78ec71a41c"
              + sse_algorithm     = "aws:kms"
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ delegate_access_key_id     = "AKIAW32ATO5LD7TVC6NI" -> {
      + "2022-12" = (known after apply)
    }
  ~ delegate_secret_access_key = "wcFMA+4kFetGXavOARAA7VpRC0mupHVrjO0HUvgdw1XMZF8RcQDHIZ6UcJEPhhRRITpUNwe63otdObhTLi7fXEuP8nDDZ7DwH3KGcjN9RXChsD6UA68AAhhND6jQNsYR5TbqZN4sGjWCPpkaPbHPHRN1pvA/+X+UE80kKZrrmuTZrzmX/TmxGIzIceGF6ynwq6lKVkKVjKHeACGEbjBmKkvtgUFVQf59EFgqjo+0SJGka9UQGhVWTMgaYApHcXpYA6ZP7WrAlxlV5PPXWG7zukZfc/QtU++WlXuC0ZnEc26CIgefqY3ozVZoD06iVzw1M7dXA1AemyY/MtZOWPcXp2AxAkX5tBQrFGR/k9bX9TKdrtWhMlMjyNLviqjk/8387uYKNDf85hu9h1KIRaFOcBpWg/D9Ya55r1nmFyQtpciIIPIH5YJonyZV/rdhP48MjlLx5x2HLd5AQYKa2YPpIRof/YfAWJ8w2R3Jyx3xt72O0uw/VMS850/1JWym5ZkH8QaBB6s1PDLvG7FozCXMZCDwbQn7Fa4IkrkQYjP9GpnOMqpCj4ZisgS5wgblpvOIJiwGyjQKWJ8kKJ1S/VVfC5astmXjpD5UyOPc2mtoil6L2ee9Rzlg1RTebhgpTLFM1lJG6jVASO+mE2UBn4kzk8JcVVdVw5mB4eJ2Cyd9VLa6UZzRFNAWQ2vYZq3j+vnS4AHkWVVC/wzq4BI2jghte5kTXuG+POD/4EDhm9XgVuJkNw/Q4NrleyHijK0UCbKeIYTK4cQRnvZM1ploZrbguYBuN0v1+THggePEUYC5GFeeMeDk5Lj9aEfGBjq1voiqXf311f7iAhtO2eEh2QA=" -> {
      + "2022-12" = (known after apply)
    }

```

</details>

*Pusher: @thomasduchatelle, Action: `pull_request`*